Repository: mozilla-l10n/mt-training-data
Catalog: sat/sat_pontoon.tmx
Source language: en_us
Languages: sat

source: 1 add-on
sat: 1 ᱮᱰ-ᱚᱱ

source: %1$d new permissions are required
sat: %1$d ᱱᱟᱶᱟ ᱪᱷᱟᱹᱲ ᱨᱮᱭᱟᱜ ᱫᱚᱨᱠᱟᱨ ᱢᱮᱱᱟᱜ-ᱟ

source: %1$d out of %2$d
sat: %2$d ᱠᱷᱚᱱ %1$d

source: %1$d selected
sat: %1$d ᱵᱟᱪᱷᱟᱣᱮᱱᱟ

source: 1. Go to Android Settings
sat: ᱑. Android ᱥᱟᱡᱟᱣ ᱠᱚ ᱨᱮ ᱪᱟᱞᱟᱜ ᱢᱮ

source: 1 open tab. Tap to switch tabs.
sat: 1 ᱴᱮᱵᱽ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ ᱾ ᱴᱮᱵᱽ ᱵᱚᱫᱚᱞ ᱞᱟᱹᱜᱤᱫ ᱴᱤᱯᱟᱹᱣ ᱢᱮ ᱾

source: %1$s add-ons
sat: %1$s ᱮᱰ-ᱚᱱᱥ

source: %1$s can’t download this file type
sat: %1$s ᱱᱚᱶᱟ ᱞᱮᱠᱟᱱᱟ ᱨᱮᱫ ᱵᱟᱭ ᱰᱟᱩᱱᱞᱳᱰ ᱫᱟᱲᱮᱜ ᱠᱟᱱᱟᱭ

source: %1$s clears your search and browsing history from private tabs when you close them or quit the app. While this doesn’t make you anonymous to websites or your internet service provider, it makes it easier to keep what you do online private from anyone else who uses this device.
sat: %1$s ᱟᱢᱟᱜ ᱥᱮᱸᱫᱽᱨᱟ ᱟᱨ ᱯᱟᱱᱛᱮᱭᱟᱜ ᱦᱤᱛᱟᱹᱞ ᱱᱤᱡᱮᱨᱟᱜ ᱴᱮᱵ ᱠᱷᱚᱱ ᱯᱷᱟᱨᱪᱟ ᱭᱟᱭ ᱡᱚᱠᱷᱚᱱ ᱟᱢ ᱩᱱᱠᱩ ᱵᱚᱸᱫᱚ ᱠᱚᱣᱟᱢ ᱟᱨ ᱮᱯ ᱟᱲᱟᱹᱜ ᱟᱢ. ᱱᱚᱶᱟ ᱫᱚ ᱵᱟᱝ ᱵᱟᱰᱟᱭ ᱵᱟᱝ ᱵᱮᱱᱟᱣ ᱢᱤᱭᱟᱭ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱟᱨ ᱤᱱᱴᱚᱨᱱᱮᱴ ᱮᱢᱚᱜᱤᱪ ᱠᱷᱚᱱ, ᱱᱚᱶᱟ ᱫᱚ ᱟᱞᱜᱟ ᱵᱮᱱᱟᱣ ᱟᱭ ᱫᱚᱦᱚ ᱞᱟᱹᱜᱤᱛ ᱪᱷᱤ ᱠᱚ ᱟᱢ ᱚᱱᱞᱟᱭᱤᱱ ᱠᱚᱨᱟᱣ ᱫᱟᱢ ᱩᱱᱠᱩ ᱠᱷᱚᱱ ᱡᱟ ᱱᱚᱶᱟ ᱥᱟᱫᱷᱚᱱ ᱵᱮᱵᱷᱟᱨ ᱟᱠᱚ ᱾

source: %1$s has a new update
sat: %1$s ᱞᱟᱹᱜᱤᱫ ᱱᱟᱶᱟ ᱦᱟᱹᱞᱤᱭᱟᱜ ᱢᱮᱱᱟᱜ-ᱟ

source: %1$s has been added to %2$s
sat: %1$s %2$s ᱨᱮ ᱥᱮᱞᱮᱫᱽ ᱦᱚᱭ ᱱᱟ

source: %1$s is produced by Mozilla.
sat: %1$s ᱛᱮᱭᱟᱨ ᱦᱩᱭ ᱠᱟᱱᱟ Mozilla ᱫᱟᱨᱟᱭᱛᱮ ᱾

source: %1$s is requesting your username and password.
sat: %1$s ᱫᱚ ᱟᱢᱟᱜ ᱭᱩᱡᱟᱹᱨᱱᱮᱢ ᱟᱨ ᱯᱟᱥᱣᱟᱹᱨᱰ ᱠᱷᱚᱡ ᱠᱟᱱᱟᱭ ᱾

source: %1$s open tabs. Tap to switch tabs.
sat: %1$s ᱴᱮᱵ ᱠᱚ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ ᱾ ᱴᱮᱵ ᱵᱚᱫᱚᱞ ᱞᱟᱹᱜᱤᱫ ᱴᱤᱯᱟᱹᱣ ᱢᱮ ᱾

source: %1$s (Private Mode)
sat: %1$s (ᱯᱨᱭᱣᱮᱴ ᱢᱳᱰ)

source: 1 tab
sat: 1 ᱴᱮᱵ

source: %2$s is requesting your username and password. The site says: “%1$s”
sat: %2$s ᱫᱚ ᱟᱢᱟᱜ ᱭᱩᱡᱟᱹᱨᱱᱮᱢ ᱟᱨ ᱯᱟᱥᱥᱣᱟᱹᱨᱰ ᱠᱷᱚᱡ ᱠᱟᱱᱟᱭ ᱾ ᱥᱟᱭᱴ ᱮ ᱢᱮᱱᱮᱜᱼᱟᱭ: “%1$s”

source: 2. Tap <b>Permissions</b>
sat: ᱒. <b>ᱪᱷᱟᱹᱲ ᱠᱚ</b> ᱚᱛᱟᱭ ᱢᱮ

source: 3. Toggle <b>%1$s</b> to ON
sat: ᱓. <b>%1$s</b> ᱪᱚᱞᱩᱤ ᱢᱮ

source: About
sat: ᱵᱟᱵᱚᱛ

source: About %1$s
sat: %1$s ᱨᱮᱭᱟᱜ ᱵᱟᱵᱚᱛ

source: Accept and edit suggestion
sat: ᱵᱟᱛᱟᱣᱢᱮ ᱟᱨ ᱥᱩᱡᱷᱟᱹᱣ ᱥᱟᱯᱲᱟᱣ ᱢᱮ

source: Accept the Risk and Continue
sat: ᱡᱤᱢᱟ ᱦᱟᱛᱟᱣ ᱢᱮ ᱟᱨ ᱥᱮᱱᱚᱜ ᱢᱮ

source: Access browser activity during navigation
sat: ᱵᱨᱟᱩᱡᱟᱹᱨ ᱨᱮᱭᱟᱜ ᱠᱟᱹᱢᱤ ᱟᱹᱛᱩᱨ ᱢᱮ ᱯᱟᱱᱛᱮ ᱜᱷᱚᱰᱤ

source: Access browser tabs
sat: ᱵᱨᱟᱩᱡᱚᱨ ᱴᱮᱵ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Access browsing history
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱦᱤᱛᱟᱹᱞ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Accessibility
sat: ᱟᱹᱛᱩᱨ ᱫᱟᱲᱮᱭᱟᱜ

source: Access recently closed tabs
sat: ᱱᱤᱛᱚᱜᱽᱼᱟᱜ ᱵᱚᱸᱫᱚᱼᱟᱜ ᱴᱮᱵ ᱠᱚ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Access to the file was denied
sat: ᱨᱮᱫ ᱨᱮ ᱫᱚᱠᱷᱚᱞ ᱵᱟᱹᱰ

source: Access your data for %1$s
sat: %1$s ᱞᱟᱹᱜᱤᱛ ᱟᱢᱟᱜ ᱰᱟᱴᱟ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Access your data for all websites
sat: ᱡᱚᱛᱚ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱛ ᱟᱢᱟᱜ ᱰᱟᱴᱟ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Access your data for sites in the %1$s domain
sat: ᱟᱢᱟᱜ ᱰᱟᱴᱟ ᱟᱹᱛᱩᱨ ᱢᱮ ᱚᱱᱟ ᱥᱟᱭᱤᱴ ᱠᱚ ᱞᱟᱹᱜᱤᱛ ᱡᱟ %1$s ᱰᱚᱢᱮᱱ ᱨᱮ ᱢᱮᱱᱟᱜᱼᱟ

source: Access your data on %1$d other domains
sat: ᱟᱢᱟᱜ ᱰᱟᱴᱟ %1$d ᱚᱞᱜᱟ ᱰᱚᱢᱮᱱ ᱠᱚᱨᱮ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Access your data on %1$d other sites
sat: ᱟᱢᱟᱜ ᱰᱟᱴᱟ %1$d ᱚᱞᱜᱟ ᱥᱟᱭᱤᱴ ᱠᱚᱨᱮ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Access your data on 1 other domain
sat: ᱟᱢᱟᱜ ᱰᱟᱴᱟ 1 ᱚᱞᱜᱟ ᱰᱚᱢᱮᱱ ᱨᱮ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Access your data on 1 other site
sat: ᱟᱢᱟᱜ ᱰᱟᱴᱟ 1 ᱚᱞᱜᱟ ᱥᱟᱭᱤᱴ ᱨᱮ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Access your location
sat: ᱟᱢᱟᱜ ᱡᱟᱭᱜᱟ ᱟᱹᱛᱩᱨ ᱢᱮ

source: Account
sat: ᱠᱷᱟᱛᱟ

source: Account settings
sat: ᱠᱷᱟᱛᱟ ᱨᱮᱭᱟᱜ ᱥᱟᱡᱟᱣ ᱠᱚ

source: A completely redesigned browser awaits, with improved performance and features to help you do more online.\n\nPlease wait while we update %s with your
sat: ᱯᱭᱨᱟ ᱱᱟᱶᱟ ᱨᱤᱰᱤᱭᱟᱭᱤᱸᱰ ᱵᱨᱟᱩᱡᱚᱨ ᱛᱟᱸᱜᱤ ᱟᱠᱟᱫᱟᱭ, ᱵᱮᱥ ᱠᱟᱹᱢᱤ ᱟᱨ ᱯᱷᱤᱪᱚᱨ ᱠᱚ ᱥᱟᱞᱟᱜ ᱛᱮ ᱚᱠᱟ ᱫᱚ ᱟᱨᱦᱚᱸ ᱚᱱᱞᱟᱭᱤᱱ ᱠᱟᱹᱢᱤ ᱠᱚᱨᱟᱣ ᱞᱟᱹᱜᱤᱫ ᱜᱚᱲᱚ ᱢᱮᱟᱭ ᱾ \n\nᱫᱚᱭᱟᱠᱟᱛᱮ ᱛᱟᱸᱜᱤ ᱢᱮ ᱟᱢᱟᱜ %s ᱦᱟᱹᱞᱤᱭᱟᱜ ᱦᱟᱹᱵᱤᱡ

source: Adapts to your device settings
sat: ᱟᱢᱟᱜ ᱥᱟᱫᱷᱚᱱ ᱨᱮᱭᱟᱜ ᱥᱟᱡᱟᱣ ᱦᱟᱛᱟᱣ ᱟᱭ

source: Add
sat: ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add %1$s?
sat: %1$s ᱥᱮᱞᱮᱫᱽ ᱟᱢ?

source: Add %1$s and %2$s to %3$s
sat: %1$s ᱟᱨ %2$s %3$s ᱨᱮ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add %1$s to %2$s
sat: %2$s ᱨᱮ %1$s ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add a shortcut to open private tabs from your Home screen.
sat: ᱟᱢᱟᱜ ᱚᱲᱟᱜ ᱤᱥᱠᱨᱤᱱ ᱠᱷᱚᱱ ᱱᱤᱡᱮᱨᱟᱜ ᱴᱮᱵᱽ ᱡᱷᱤᱡ ᱞᱟᱹᱜᱤᱫ ᱛᱮ ᱢᱤᱫᱴᱟᱹᱝ ᱠᱷᱟᱴᱚᱢᱟᱪᱷᱟ ᱥᱮᱞᱮᱫᱽ ᱛᱟᱞᱟᱝ ᱢᱮ ᱾

source: Added to top sites!
sat: ᱪᱮᱛᱟᱱ ᱥᱟᱭᱤᱴ ᱨᱮ ᱥᱮᱞᱮᱫᱽ ᱮᱱᱥ!

source: Add folder
sat: ᱯᱚᱴᱚᱢ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add new collection
sat: ᱱᱟᱶᱟ ᱛᱩᱢᱟᱹᱞ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add-on collection modified. Quitting the application to apply changes…
sat: ᱥᱮᱞᱮᱫᱽ ᱮᱦᱚᱵᱽ ᱛᱩᱢᱟᱹᱞ ᱵᱚᱫᱚᱞᱮᱱᱟ ᱾ ᱵᱚᱫᱚᱞ ᱠᱚ ᱫᱚᱦᱚ ᱞᱟᱹᱜᱤᱫ ᱮᱯᱯᱞᱤᱠᱮᱥᱚᱱ ᱵᱚᱸᱫᱚᱜ ᱠᱟᱱᱟ…

source: Add-ons
sat: ᱮᱰ-ᱟᱸᱱᱥ

source: Add-ons Manager
sat: ᱥᱮᱞᱮᱫᱽ ᱮᱦᱚᱵᱽ ᱵᱮᱵᱚᱥᱛᱟ

source: Add-on updates
sat: ᱮᱰ-ᱚᱱ ᱨᱮᱭᱟᱜ ᱦᱟᱹᱞᱤᱭᱟᱜ

source: Add private browsing shortcut
sat: ᱱᱤᱡᱮᱨᱟᱜ ᱵᱨᱟᱩᱡᱤᱝ ᱠᱷᱟᱴᱚᱢᱟᱪᱷᱟ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add private tab
sat: ᱱᱤᱡᱮᱨᱟᱜ ᱴᱮᱵ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Address bar
sat: ᱴᱷᱤᱠᱟᱹᱱᱟ ᱦᱩᱨᱠᱟᱹᱬ

source: Address Not Found
sat: ᱴᱷᱤᱠᱬᱟᱹ ᱵᱟᱝ ᱧᱟᱞ ᱞᱟᱱᱟ

source: Add search engine
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱤᱱᱡᱤᱱ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add shortcut
sat: ᱠᱷᱟᱴᱚᱢᱟᱪᱷᱟ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add tab
sat: ᱴᱮᱵ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add them to %1$s
sat: %1$s ᱨᱮ ᱥᱮᱞᱮᱫᱽ ᱠᱚᱢ

source: Add to contact
sat: ᱥᱚᱢᱯᱚᱨᱠ ᱨᱮ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add to Home screen
sat: ᱚᱲᱟᱜ ᱤᱥᱠᱨᱤᱱ ᱨᱮ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add to top sites
sat: ᱪᱮᱛᱟᱱ ᱥᱟᱭᱤᱴ ᱨᱮ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Add username to saved password?
sat: ᱥᱟᱸᱪᱟᱣᱠᱟᱱ ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫᱽ ᱨᱮ ᱵᱮᱵᱷᱟᱨᱤᱡ ᱧᱩᱛᱩᱢ ᱥᱮᱞᱮᱫᱽ ᱟᱢ?

source: Add widget
sat: ᱣᱤᱡᱮᱴ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Advanced
sat: ᱞᱟᱦᱟᱱᱛᱤ

source: Advanced…
sat: ᱞᱟᱦᱟᱱᱛᱤ…

source: After one day
sat: ᱢᱤᱫ ᱢᱟᱦᱟ ᱛᱟᱭᱚᱢ

source: After one month
sat: ᱢᱤᱫ ᱪᱟᱸᱫᱚ ᱛᱟᱭᱚᱢ

source: After one week
sat: ᱢᱤᱫ ᱦᱟᱴ ᱛᱟᱭᱚᱢ

source: All actions
sat: ᱡᱚᱛᱚ ᱠᱟᱹᱢᱤᱠᱚ

source: All cookies (will cause websites to break)
sat: ᱠᱷᱚᱛᱚ ᱠᱩᱩᱠᱤ ᱠᱚ (ᱱᱚᱶᱟ ᱫᱚ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱠᱚ ᱨᱟᱹᱯᱩᱫᱟᱭ)

source: Allow
sat: ᱦᱮᱥᱟᱨᱤᱭᱟᱹ

source: ALLOW
sat: ᱢᱟᱹᱱᱡᱩᱨ

source: Allow %1$s to open %2$s
sat: %1$s ᱵᱟᱛᱟᱣ ᱮᱢᱟᱭ ᱢᱮ %2$s ᱡᱷᱤᱡ ᱞᱟᱹᱜᱤᱛ ᱛᱮ

source: Allow %1$s to play DRM-controlled content?
sat: %1$s DRM-ᱠᱚᱵᱽᱡᱟ ᱡᱤᱱᱤᱥ ᱠᱚ ᱯᱞᱮ ᱪᱷᱚ ᱞᱟᱹᱜᱤᱫ ᱚᱱᱩᱢᱚᱛᱤ ᱮᱢᱟᱭᱟ ᱥᱮ?

source: Allow %1$s to send notifications?
sat: ᱤᱛᱞᱟᱹᱭ ᱠᱩᱞ ᱞᱟᱹᱜᱤᱫ ᱛᱮ %1$s ᱦᱮᱥᱟᱨᱤᱭᱟᱹ ᱮᱢᱟᱭ ᱢᱮ?

source: Allow %1$s to store data in persistent storage?
sat: %1$s ᱵᱮᱥ ᱡᱟᱭᱜᱟ ᱨᱮ ᱰᱟᱴᱟ ᱫᱚᱦᱚ ᱪᱷᱚᱭᱮᱢ ᱥᱮ?

source: Allow %1$s to use your camera?
sat: ᱟᱢᱟᱜ ᱠᱮᱢᱨᱟ ᱵᱮᱵᱷᱟᱨ ᱞᱟᱹᱜᱤᱛ ᱛᱮ %1$s ᱦᱮᱥᱟᱨᱤᱭᱟᱹ ᱮᱢᱟᱭ ᱢᱮ?

source: Allow %1$s to use your camera and microphone?
sat: ᱟᱢᱟᱜ ᱠᱮᱢᱨᱟ ᱟᱨ ᱢᱟᱭᱠᱨᱚᱯᱷᱚᱱ ᱵᱮᱵᱷᱟᱨ ᱞᱟᱹᱜᱤᱛ ᱛᱮ %1$s ᱦᱮᱥᱟᱨᱤᱭᱟᱹ ᱮᱢᱟᱭ ᱢᱮ?

source: Allow %1$s to use your location?
sat: ᱟᱢᱟᱜ ᱡᱟᱭᱜᱟ ᱵᱮᱵᱷᱟᱨ ᱞᱟᱹᱜᱤᱛ ᱛᱮ %1$s ᱦᱮᱥᱟᱨᱤᱭᱟᱹ ᱮᱢᱟᱭ ᱢᱮ?

source: Allow %1$s to use your microphone?
sat: ᱟᱢᱟᱜ ᱢᱟᱭᱠᱨᱚᱯᱷᱚᱱ ᱵᱮᱵᱷᱟᱨ ᱞᱟᱹᱜᱤᱛ ᱛᱮ %1$s ᱦᱮᱥᱟᱨᱤᱭᱟᱹ ᱮᱢᱟᱭ ᱢᱮ?

source: Allow audio and video
sat: ᱟᱰᱤᱭᱳ ᱟᱨ ᱣᱤᱰᱤᱭᱳ ᱦᱮᱥᱟᱨᱤᱭᱟᱹ ᱢᱮ

source: Allowed
sat: ᱵᱟᱛᱟᱣ ᱮᱢᱟᱠᱟᱱᱟ

source: Allow in private browsing
sat: ᱱᱤᱡᱚᱨᱟᱜ ᱵᱨᱟᱩᱡᱤᱝ ᱨᱮ ᱪᱟᱹᱞᱩ ᱪᱷᱚᱭ ᱮᱢ

source: Allow screenshots in private browsing
sat: ᱱᱤᱡᱮᱨᱟᱜ ᱵᱨᱟᱩᱡᱤᱝ ᱨᱮ ᱥᱠᱨᱤᱱᱥᱚᱴ ᱠᱚ ᱦᱮᱥᱟᱨᱤᱭᱟᱹ ᱢᱮ

source: Allow search suggestions in private sessions?
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱥᱚᱞᱦᱟ ᱱᱤᱡᱮᱨᱟᱜ ᱚᱠᱛᱚ ᱨᱮ ᱵᱟᱛᱟᱣ ᱮᱢᱟᱢ ᱥᱮ?

source: Allows Mozilla to install and collect data for experimental features
sat: ᱮᱠᱥᱯᱮᱨᱤᱢᱮᱱᱴᱟᱞ ᱯᱷᱤᱪᱚᱨ ᱞᱟᱹᱜᱤᱫ Mozilla ᱟᱹᱛᱩᱨ ᱟᱨ ᱰᱟᱴᱟ ᱡᱟᱣᱨᱟ ᱪᱷᱚᱭᱮᱢ

source: Allows Mozilla to install and run studies
sat: Mozilla ᱥᱚᱫᱽᱷ ᱞᱚ ᱟᱹᱛᱩᱨ ᱟᱨ ᱫᱟᱹᱲ ᱪᱷᱚ ᱞᱟᱹᱤᱫᱽ ᱢᱮᱛᱟᱭ ᱢᱮ

source: All third-party cookies (may cause websites to break)
sat: ᱡᱷᱚᱛᱚ ᱯᱮᱼᱯᱟᱨᱴᱭ ᱠᱩᱩᱠᱤ ᱠᱚ (ᱱᱚᱶᱟ ᱫᱚ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱠᱚ ᱨᱟᱹᱯᱩᱫ ᱫᱟᱲᱮᱭᱟᱜᱼᱟᱭ)

source: A login with that username already exists
sat: ᱢᱤᱫᱴᱟᱹᱝ ᱵᱚᱞᱚ ᱵᱮᱵᱷᱟᱨᱤᱭᱟᱹ ᱢᱟᱲᱟᱝ ᱠᱷᱣᱱ ᱢᱮᱱᱟᱭᱟ ᱾

source: Alphabetically
sat: ᱟᱠᱷᱚᱨ ᱛᱷᱟᱨ ᱞᱮᱠᱟ ᱛᱮ

source: Already have an account?
sat: ᱞᱟᱦᱟ ᱠᱷᱚᱱ ᱠᱷᱟᱛᱟ ᱢᱮᱱᱟᱜ ᱛᱟᱢᱟ?

source: Always
sat: ᱡᱟᱣᱜᱮ

source: A new permission is required
sat: ᱢᱤᱫ ᱴᱟᱝ ᱱᱟᱶᱟ ᱪᱷᱟᱹᱲ ᱨᱮᱭᱟᱜ ᱫᱚᱨᱠᱟᱨ ᱢᱮᱱᱟᱜ-ᱟ

source: Appearance
sat: ᱧᱮᱞ ᱵᱤᱰᱟᱹᱣ

source: Apr
sat: ᱪᱟᱹᱛ

source: Are you sure?
sat: ᱟᱢ ᱜᱚᱴᱟ ᱛᱮ ᱢᱮᱱᱟᱢ-ᱟ?

source: Are you sure that you want to clear all the permissions for this site?
sat: ᱟᱢ ᱪᱮᱫ ᱡᱷᱚᱛᱚ ᱞᱮᱠᱷᱟᱛᱮ ᱡᱷᱚᱛᱚ ᱚᱱᱩᱢᱚᱛᱤ ᱱᱚᱶᱟ ᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱫ ᱢᱮᱴᱟᱣ ᱥᱮᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Are you sure that you want to clear all the permissions on all sites?
sat: ᱟᱢ ᱪᱮᱫ ᱡᱷᱚᱛᱚ ᱞᱮᱠᱷᱟᱛᱮ ᱡᱷᱚᱛᱚ ᱚᱱᱩᱢᱚᱛᱤ ᱡᱷᱚᱛᱚ ᱥᱟᱭᱤᱴ ᱠᱚ ᱞᱟᱹᱜᱤᱫ ᱢᱮᱴᱟᱣ ᱥᱮᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Are you sure that you want to clear this permission for this site?
sat: ᱟᱢ ᱪᱮᱫ ᱡᱷᱚᱛᱚ ᱞᱮᱠᱷᱟᱛᱮ ᱱᱚᱶᱟ ᱚᱱᱩᱢᱚᱛᱤ ᱱᱚᱶᱟ ᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱫ ᱢᱮᱴᱟᱣ ᱥᱮᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Are you sure you want to clear your downloads?
sat: ᱟᱢ ᱡᱷᱚᱛᱚ ᱞᱮᱠᱷᱟ ᱛᱮ ᱟᱢᱟᱜ ᱰᱟᱩᱱᱞᱳᱰ ᱠᱚ ᱢᱮᱴᱟᱣ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Are you sure you want to clear your history?
sat: ᱪᱮᱫ ᱟᱢ ᱜᱚᱴᱟ ᱛᱮ ᱢᱮᱱᱟᱢᱼᱟ ᱟᱢᱟᱜ ᱦᱤᱛᱟᱹᱞ ᱢᱮᱴᱟᱣ ᱞᱟᱹᱜᱤᱛ ᱛᱮ?

source: Are you sure you want to delete %1$s?
sat: %1$s ᱢᱮᱴᱟᱣ ᱞᱟᱹᱜᱤᱛ ᱛᱮ ᱪᱮᱫ ᱟᱢ ᱜᱚᱴᱟ ᱛᱮ ᱢᱮᱱᱟᱢ-ᱟ?

source: Are you sure you want to delete this bookmark?
sat: ᱪᱮᱫ ᱟᱢ ᱜᱚᱴᱟ ᱢᱮᱱᱟᱢᱼᱟ ᱱᱚᱶᱟ ᱵᱩᱠᱢᱟᱨᱠ ᱢᱮᱴᱟᱣ ᱞᱟ.ᱜᱤᱫ ᱛᱮ?

source: Are you sure you want to delete this folder?
sat: ᱪᱮᱫ ᱟᱢ ᱜᱚᱴᱟ ᱛᱮ ᱢᱮᱱᱟᱢᱼᱟ ᱱᱚᱶᱟ ᱯᱚᱴᱚᱢ ᱢᱮᱴᱟᱣ ᱞᱟ.ᱜᱤᱛ ᱛᱮ?

source: Are you sure you want to delete this login?
sat: ᱪᱮᱫ ᱟᱢ ᱜᱚᱴᱟ ᱢᱮᱱᱟᱢᱼᱟ ᱱᱚᱶᱟ ᱞᱚᱜᱤᱱ ᱢᱮᱴᱟᱣ ᱞᱟ.ᱜᱤᱫ ᱛᱮ?

source: A site is playing media
sat: ᱢᱤᱫᱴᱟᱹᱝ ᱥᱟᱭᱤᱴ ᱢᱤᱰᱤᱭᱟ ᱮᱱᱮᱡ ᱫᱟᱭ

source: Ask to allow
sat: ᱦᱮᱥᱟᱨᱤᱭᱟᱹ ᱞᱟᱹᱜᱤᱫ ᱠᱩᱠᱞᱤ ᱢᱮ

source: Ask to save
sat: ᱥᱟᱸᱪᱟᱣ ᱞᱟᱹᱜᱤᱫ ᱛᱮ ᱠᱩᱠᱞᱤ

source: Audio and video will play on Wi-Fi
sat: ᱟᱰᱤᱭᱳ ᱟᱨ ᱣᱤᱰᱤᱭᱳ Wi-Fi ᱨᱮ ᱮᱱᱮᱡᱚᱣᱟ

source: Aug
sat: ᱥᱟᱱ

source: Authors
sat: ᱚᱱᱚᱞᱤᱭᱟᱹ ᱠᱚ

source: Autocomplete URLs
sat: URLs ᱟᱪᱛᱮ ᱯᱩᱨᱟᱹᱣᱼᱜ ᱢᱟ

source: Autofill
sat: ᱟᱪᱛᱮ ᱯᱮᱨᱮᱡ

source: Automatic
sat: ᱟᱪᱛᱮ

source: Automatically deletes browsing data when you select "Quit" from the main menu
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱴᱟ ᱟᱪᱛᱮ ᱢᱮᱴᱟᱣ ᱛᱟᱦᱮᱱᱟᱭ ᱡᱚᱠᱷᱚᱱ ᱟᱢ \"ᱟᱲᱟᱹᱜ\" ᱵᱟᱪᱷᱟᱣ ᱛᱟᱦᱮᱱᱟᱢ ᱢᱩᱞ ᱢᱮᱱᱩ ᱠᱷᱚᱱ

source: Automatically deletes browsing data when you select \"Quit\" from the main menu
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱴᱟ ᱟᱪᱛᱮ ᱢᱮᱴᱟᱣ ᱛᱟᱦᱮᱱᱟᱭ ᱡᱚᱠᱷᱚᱱ ᱟᱢ \"ᱟᱲᱟᱹᱜ\" ᱵᱟᱪᱷᱟᱣ ᱛᱟᱦᱮᱱᱟᱢ ᱢᱩᱞ ᱢᱮᱱᱩ ᱠᱷᱚᱱ

source: Automatic font sizing
sat: ᱟᱪᱛᱮ ᱪᱤᱠᱤ ᱥᱟᱡᱟᱣ

source: Automatic privacy
sat: ᱟᱡ ᱛᱮᱭᱟᱜ ᱱᱤᱥᱚᱱ

source: Autoplay
sat: ᱟᱪᱛᱮ ᱮᱱᱮᱡ

source: Back
sat: ᱛᱟᱭᱚᱢ

source: Baidu
sat: ᱵᱟᱭᱰᱩ

source: Basics
sat: ᱥᱟᱫᱷᱟᱨᱚᱬ

source: Block audio and video
sat: ᱟᱰᱤᱭᱳ ᱟᱨ ᱣᱤᱰᱤᱭᱳ ᱟᱴᱠᱟᱣ ᱢᱮ

source: Block audio and video on cellular data only
sat: ᱥᱮᱞᱩᱞᱟᱹᱨ ᱰᱟᱴᱟ ᱨᱮᱜᱤ ᱟᱰᱤᱭᱳ ᱟᱨ ᱣᱤᱰᱤᱭᱳ ᱟᱴᱠᱟᱣ ᱢᱮ

source: Block audio only
sat: ᱟᱰᱤᱭᱳ ᱜᱤ ᱟᱴᱠᱟᱣ ᱢᱮ

source: Block content and scripts that track you online
sat: ᱠᱚᱱᱴᱮᱸᱱᱴ ᱟᱨ ᱥᱠᱨᱭᱤᱯᱴ ᱠᱚ ᱟᱴᱠᱟᱣ ᱢᱮ ᱡᱟ ᱟᱢ ᱯᱟᱸᱡᱟ ᱢᱮᱭᱟᱹ ᱠᱚ

source: Blocked
sat: ᱟᱠᱚᱴ ᱠᱟᱱᱟ

source: Blocked by Android
sat: Android ᱫᱟᱨᱟᱭ ᱛᱮ ᱟᱠᱚᱴ ᱦᱩᱭ ᱟᱠᱟᱱᱟ

source: Blocks cookies that ad networks and analytics companies use to compile your browsing data across many sites.
sat: ᱮᱰ ᱱᱮᱴᱣᱳᱨᱠ ᱠᱚ ᱟᱨ ᱮᱱᱟᱞᱭᱴᱤᱠ ᱠᱚᱢᱯᱟᱱᱤ ᱠᱚ ᱮᱢᱟᱱ ᱠᱩᱻᱠᱤᱡ ᱠᱚ, ᱚᱠᱟ ᱫᱚ ᱟᱭᱢᱟ ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱴᱟ ᱠᱚ ᱠᱚᱢᱯᱟᱭᱤᱞ ᱞᱟᱹᱜᱤᱫᱽ ᱵᱮᱵᱷᱟᱨᱚᱜᱼᱟ ᱚᱱᱟ ᱠᱚ ᱵᱞᱚᱠ ᱟᱭ ᱾

source: Blocks fewer trackers. Pages will load normally.
sat: ᱠᱚᱢ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ ᱵᱚᱸᱫᱚᱭᱮᱟ ᱾ ᱥᱟᱦᱴᱟ ᱢᱟᱲᱟᱝ ᱞᱮᱠᱷᱟ ᱞᱟᱫᱮᱜᱼᱟ ᱾

source: Blocks more trackers, ads, and popups. Pages load faster, but some functionality might not work.
sat: ᱡᱟᱹᱥᱛᱤ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ, ᱰᱷᱟᱣᱨᱟ ᱟᱨ ᱴᱟᱴᱠᱟ ᱚᱰᱚᱠ ᱠᱚ ᱟᱴᱠᱟᱣ ᱟᱭ , ᱥᱟᱠᱟᱢ ᱞᱚᱜᱚᱱ ᱞᱚᱰᱚᱜᱼᱟ ᱦᱮᱞᱮ ᱠᱤᱪᱷᱤ ᱡᱤᱱᱤᱥ ᱴᱷᱤᱠ ᱥᱮ ᱵᱟᱭ ᱠᱟᱹᱢᱤᱟᱭ ᱾

source: Bookmark
sat: ᱵᱩᱻᱠᱢᱟᱨᱠ

source: Bookmark created.
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱵᱮᱱᱟᱣᱱᱟ ᱾

source: Bookmark menu
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱢᱮᱱᱩ

source: Bookmarks
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱠᱚ

source: Bookmark saved!
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱥᱟᱸᱪᱟᱣᱮᱱᱟ!

source: Bookmarks deleted
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱠᱚ ᱢᱮᱴᱟᱣᱮᱱᱟ

source: Bookmarks Menu
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱢᱮᱱᱩ

source: Bookmarks saved!
sat: ᱵᱩᱻᱠᱢᱟᱨᱠ ᱠᱚ ᱥᱟᱺᱪᱟᱣ ᱮᱱᱟ!

source: Bookmarks Toolbar
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱦᱚᱛᱷᱤᱭᱟᱨ

source: Bottom
sat: ᱞᱟᱛᱟᱨ

source: Browse privately
sat: ᱱᱤᱡᱮᱨᱟᱜ ᱨᱮ ᱵᱨᱟᱩᱡ ᱢᱮ

source: Browse without being followed
sat: ᱯᱟᱸᱡᱟ ᱵᱮᱜᱚᱨ ᱵᱨᱟᱩᱡ ᱢᱮ

source: Browsing data deleted
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱴᱟ ᱢᱮᱴᱟᱣᱮᱱᱟ

source: Browsing history and site data
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱦᱤᱛᱟᱹᱞ ᱟᱨ ᱥᱟᱭᱤᱴ ᱰᱟᱴᱟ

source: Cached images and files
sat: ᱥᱟᱯ ᱦᱚᱭᱠᱟᱱ ᱪᱤᱛᱟᱹᱨ ᱟᱨ ᱨᱮᱫ ᱠᱚ

source: Call
sat: ᱠᱚᱞᱞ

source: Call with…
sat: ᱱᱚᱶᱟ ᱛᱮ ᱠᱚᱞᱞ ᱢᱮ ...

source: Camera
sat: ᱠᱮᱢᱨᱟ

source: Camera access needed. Go to Android settings, tap permissions, and tap allow.
sat: ᱠᱚᱢᱨᱟ ᱵᱮᱵᱷᱟᱨ ᱫᱚᱨᱠᱟᱨ ᱾ ᱮᱸᱰᱨᱚᱭᱮᱰ ᱥᱟᱡᱟᱣ ᱛᱮ ᱪᱟᱹᱞᱟᱜ ᱢᱮ, ᱪᱷᱟᱹᱲ ᱨᱮ ᱚᱛᱟᱭ ᱢᱮ , ᱟᱨ ᱮᱞᱞᱟᱣ ᱨᱮ ᱚᱛᱟᱭ ᱢᱮ ᱾

source: Camera and microphone are on
sat: ᱠᱮᱢᱨᱟ ᱟᱨ ᱢᱟᱭᱠᱨᱚᱯᱷᱚᱱ ᱚᱱ ᱢᱮᱱᱟᱜ-ᱟ

source: Camera is on
sat: ᱠᱮᱢᱨᱟ ᱪᱟᱹᱞᱩ ᱢᱮᱱᱟᱜ-ᱟ

source: Cancel
sat: ᱵᱟᱹᱰᱨᱟᱹ

source: Cannot Complete Request
sat: ᱱᱮᱦᱚᱨ ᱵᱟᱝ ᱯᱩᱨᱟᱹᱣ ᱞᱮᱱᱟ

source: Cannot share to this app
sat: ᱱᱚᱶᱟ ᱮᱯᱯ ᱵᱷᱮᱡᱟ ᱵᱟᱝ ᱜᱟᱱᱚᱜᱼᱟ

source: Can’t edit default folders
sat: ᱢᱩᱞ ᱯᱚᱴᱚᱢ ᱵᱟᱞᱮ ᱥᱟᱯᱲᱟᱣ ᱫᱟᱰᱮᱟ

source: Change the layout of open tabs. Go to settings and select grid under tab view.
sat: ᱠᱷᱩᱞᱟᱹ ᱴᱮᱵ ᱞᱮᱭᱟᱩᱴ ᱠᱚ ᱵᱚᱫᱚᱞ ᱢᱮ ᱾ ᱥᱟᱡᱟᱣ ᱴᱷᱮᱱ ᱪᱟᱞᱟᱣ ᱠᱟᱛᱮᱫᱽ ᱴᱮᱵ ᱣᱤᱣ ᱞᱟᱛᱟᱨ ᱨᱮ ᱜᱨᱤᱰ ᱵᱟᱪᱷᱟᱣ ᱢᱮ ᱾

source: Check that search string matches Example format
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱥᱴᱨᱭᱸᱜ ᱢᱮᱪ ᱠᱚ ᱨᱮᱭᱟᱜ ᱡᱮᱢᱚᱱ ᱯᱷᱚᱨᱢᱟᱴ ᱠᱚ ᱧᱮᱞ ᱵᱤᱰᱟᱹᱣ ᱢᱮ

source: Check your network connection or try reloading the page in a few moments.
sat: ᱱᱮᱴᱣᱟᱨᱠ ᱡᱩᱲᱟᱹᱣ ᱧᱮᱞ ᱵᱤᱰᱟᱹᱣ ᱢᱮ ᱟᱨ ᱵᱟᱝ ᱠᱤᱪᱷᱤ ᱥᱚᱢᱚᱭ ᱯᱚᱨᱮ ᱥᱟᱦᱴᱟ ᱫᱩᱦᱲᱟᱹ ᱨᱤᱞᱚᱰ ᱢᱮ ᱾

source: Choose a color
sat: ᱨᱚᱝ ᱵᱟᱪᱷᱟᱣ ᱛᱟᱞᱟᱝ ᱢᱮ

source: Choose what to sync
sat: ᱚᱠᱟ ᱥᱭᱸᱠ ᱨᱮᱭᱟᱜ ᱛᱟᱦᱮᱸᱱᱟ ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Choose which trackers and scripts to block.
sat: ᱵᱟᱪᱷᱟᱣ ᱢᱮ ᱚᱠᱟ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ ᱟᱨ ᱥᱠᱨᱤᱯᱴ ᱞᱚ ᱵᱞᱚᱠ ᱠᱚᱣᱟ ᱾

source: Choose your theme
sat: ᱩᱭᱦᱟᱹᱨ ᱵᱟᱪᱷᱟᱣ ᱛᱟᱢ

source: Clear
sat: ᱯᱷᱟᱨᱪᱟ

source: Clear password
sat: ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ ᱯᱷᱟᱨᱪᱟᱭ ᱢᱮ

source: Clear permission
sat: ᱪᱷᱟᱹᱲ ᱯᱷᱟᱨᱪᱟᱭ ᱢᱮ

source: Clear permissions
sat: ᱪᱷᱟᱹᱲ ᱠᱚ ᱯᱷᱟᱨᱪᱟᱭ ᱢᱮ

source: Clear permissions on all sites
sat: ᱥᱟᱱᱟᱢ ᱥᱟᱭᱤᱴ ᱨᱮ ᱪᱷᱟᱹᱲ ᱠᱚ ᱯᱷᱟᱨᱪᱟᱭ ᱢᱮ

source: Clear recent browsing history, cookies, and related data
sat: ᱱᱤᱛᱚᱜᱟ ᱵᱨᱟᱩᱡᱤᱝ ᱦᱤᱛᱟᱹᱞ, ᱠᱩᱠᱤ ᱠᱚ, ᱟᱨ ᱥᱚᱸᱵᱚᱸᱫᱷ ᱰᱟᱴᱟ ᱯᱷᱟᱨᱪᱟᱭ ᱢᱮ

source: Clears cookies set by redirects to known tracking websites.
sat: ᱠᱩᱩᱠᱤ ᱠᱚ ᱥᱟᱯᱷᱟᱭ ᱟ ᱚᱠᱟ ᱫᱚ ᱵᱟᱰᱟᱭᱠᱟᱱ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱠᱚᱨᱮ ᱨᱤᱰᱟᱭᱨᱮᱠᱴ ᱟ ᱾

source: Clear username
sat: ᱵᱮᱵᱷᱟᱨᱤᱡ ᱧᱩᱛᱩᱢ ᱯᱷᱟᱨᱪᱟᱭ ᱢᱮ

source: Click for more details
sat: ᱟᱨᱦᱚᱸ ᱵᱤᱵᱨᱚᱬ ᱞᱟᱹᱜᱤᱫ ᱱᱚᱰᱮ ᱚᱛᱟᱭ ᱢᱮ

source: Close
sat: ᱵᱚᱸᱫᱚᱭ ᱢᱮ

source: Close after one day
sat: ᱢᱤᱫᱽ ᱫᱤᱱ ᱯᱚᱨᱮ ᱵᱚᱸᱫᱚᱭ ᱢᱮ

source: Close after one month
sat: ᱢᱤᱫ ᱪᱟᱸᱫᱚ ᱯᱚᱨᱮ ᱵᱚᱸᱫᱽ ᱢᱮ

source: Close after one week
sat: ᱢᱤᱫᱽ ᱦᱟᱴ ᱯᱚᱨᱮ ᱵᱚᱸᱫ ᱢᱮ

source: Close all tabs
sat: ᱡᱷᱚᱛᱚ ᱴᱮᱵ ᱠᱚ ᱵᱚᱸᱫᱚᱭ ᱢᱮ

source: Close manually
sat: ᱱᱤᱡᱮ ᱛᱮ ᱵᱚᱸᱫᱽ ᱢᱮ

source: Close private tabs
sat: ᱯᱨᱭᱣᱮᱴ ᱴᱮᱵ ᱠᱚ ᱵᱚᱸᱫᱚᱭ ᱢᱮ

source: Close reader view
sat: ᱨᱤᱰᱚᱨ ᱵᱷᱭᱩ ᱵᱚᱸᱫᱚᱭ ᱢᱮ

source: Close tab
sat: ᱴᱮᱵ ᱵᱚᱸᱫᱽᱚᱭ ᱢᱮ

source: Close tabs
sat: ᱴᱮᱵ ᱠᱚ ᱵᱚᱸᱫᱚᱭ ᱢᱮ

source: Close tab %s
sat: %s ᱴᱮᱵ ᱵᱚᱸᱫᱚᱭ ᱢᱮ

source: Collapse suggested logins
sat: ᱵᱟᱛᱟᱣᱟᱠᱟᱱ ᱞᱚᱜᱤᱱ ᱠᱚ ᱠᱟᱹᱴᱤᱡ ᱪᱷᱚᱭ ᱢᱮ

source: Collection %d
sat: %d ᱛᱩᱢᱟᱹᱞ

source: Collection deleted
sat: ᱛᱩᱢᱟᱹᱞ ᱢᱮᱴᱟᱣᱮᱱᱟ

source: Collection menu
sat: ᱛᱩᱢᱟᱹᱞ ᱢᱮᱱᱭᱩ

source: Collection name
sat: ᱛᱩᱢᱟᱹᱞ ᱧᱩᱛᱩᱢ

source: Collection owner (User ID)
sat: ᱛᱩᱢᱟᱹᱞ ᱢᱟᱞᱤᱠ (ᱵᱮᱵᱷᱟᱨᱤᱭᱟᱹ ID)

source: Collection renamed
sat: ᱛᱩᱢᱟᱹᱞ ᱫᱚᱦᱲᱟ ᱧᱩᱛᱩᱢ ᱮᱢ ᱦᱩᱭᱮᱱᱟ

source: Collections
sat: ᱛᱩᱢᱟᱹᱞ ᱠᱚ

source: Collection saved!
sat: ᱛᱩᱢᱟᱹᱞ ᱥᱟᱸᱪᱟᱣᱮᱱᱟ!

source: Collect the things that matter to you
sat: ᱚᱱᱟ ᱡᱤᱱᱤᱥ ᱠᱚ ᱡᱟᱨᱣᱟᱭ ᱢᱮ ᱡᱟ ᱟᱢ ᱢᱮᱴᱚᱨ ᱢᱤᱭᱟ

source: Collect the things that matter to you.\nGroup together similar searches, sites, and tabs for quick access later.
sat: ᱡᱤᱱᱤᱥ ᱠᱚ ᱡᱟᱣᱨᱟᱭ ᱢᱮ ᱚᱠᱟ ᱟᱢ ᱞᱟᱹᱜᱤᱫ ᱴᱷᱤᱠ ᱟ ᱾ \nᱞᱚᱜᱚᱱ ᱧᱟᱢ ᱞᱟᱹᱜᱤᱫ ᱥᱚᱢᱟᱱ ᱥᱮᱸᱫᱽᱨᱟ, ᱥᱟᱭᱤᱴ ᱟᱨ ᱴᱮᱵ ᱠᱚ ᱫᱳᱞ ᱠᱟᱜ ᱢᱮ ᱾

source: Common myths about private browsing
sat: ᱱᱤᱡᱚᱨᱟᱜ ᱵᱨᱟᱣᱡᱤᱝ ᱨᱮᱭᱟᱜ ᱥᱚᱢᱟᱱ ᱮᱰᱮ ᱠᱚ

source: Complete action using
sat: ᱠᱟᱹᱢᱤ ᱠᱚ ᱪᱟᱵᱟᱭ ᱢᱮ

source: Confirm
sat: ᱜᱚᱴᱟ

source: Connect another device
sat: ᱚᱞᱜᱟ ᱥᱟᱫᱷᱚᱱ ᱡᱩᱰᱟᱹᱣ ᱢᱮ

source: Connect another device.
sat: ᱮᱴᱟᱜᱟᱼᱜ ᱥᱟᱫᱷᱚᱱ ᱡᱩᱰᱟᱹᱣ ᱢᱮ ᱾

source: Connect Another Device…
sat: ᱚᱞᱜᱟ ᱥᱟᱫᱷᱚᱱ ᱡᱩᱰᱟᱹᱣ ᱢᱮ…

source: Content crashed
sat: ᱡᱤᱱᱤᱥ ᱠᱨᱟᱥ

source: Content Encoding Error
sat: ᱡᱤᱱᱤᱥ ᱮᱱᱠᱳᱰᱤᱸᱝ ᱵᱷᱩᱞ

source: Continue to website
sat: ᱣᱮᱵᱥᱟᱭᱤᱴ ᱛᱮ ᱞᱟᱦᱟᱜ ᱢᱮ

source: Control browser proxy settings
sat: ᱵᱨᱟᱩᱡᱟᱹᱨ ᱯᱨᱚᱠᱥᱤ ᱥᱟᱡᱟᱣ ᱠᱚ ᱥᱟᱢᱲᱟᱣ ᱢᱮ

source: Cookies
sat: ᱠᱩᱠᱤᱡ ᱠᱚ

source: Cookies from unvisited sites
sat: ᱵᱟᱝ ᱦᱤᱨᱤᱠᱟᱱ ᱥᱟᱭᱤᱴ ᱠᱚ ᱠᱷᱚᱱ ᱠᱩᱩᱠᱤ ᱠᱚ

source: Copy
sat: ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy email address
sat: ᱤᱼᱢᱮᱞ ᱴᱷᱤᱠᱬᱟᱹ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy image location
sat: ᱪᱤᱛᱟᱹᱨ ᱨᱮᱭᱟᱜ ᱡᱟᱭᱜᱟ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy link
sat: ᱞᱤᱸᱠ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy password
sat: ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy site
sat: ᱥᱟᱭᱤᱴ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy username
sat: ᱵᱮᱵᱷᱟᱨᱤᱡ ᱧᱩᱛᱩᱢ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Corrupted Content Error
sat: ᱨᱟᱹᱯᱩᱫ ᱡᱤᱱᱤᱥ ᱦᱩᱲᱟᱹᱜ

source: Could not open file
sat: ᱨᱮᱫ ᱵᱟᱝ ᱠᱷᱩᱞᱟᱹ ᱫᱟᱲᱮᱞᱟᱱᱟ

source: Crashes
sat: ᱨᱟᱹᱯᱩᱫ ᱠᱚ

source: Crash reporter
sat: ᱨᱟᱹᱯᱩᱫ ᱞᱟᱭ-ᱟᱜ

source: Crash Reports
sat: ᱨᱟᱹᱯᱩᱫ ᱨᱤᱯᱚᱨᱴ ᱠᱚ

source: Created %s
sat: %s ᱛᱮᱭᱟᱨᱮᱱᱟ

source: Create Firefox account.
sat: Firefox ᱠᱷᱟᱛᱟ ᱛᱮᱭᱟᱨ ᱢᱮ ᱾

source: Credit cards and addresses
sat: ᱠᱨᱮᱰᱤᱴ ᱠᱟᱰ ᱠᱚ ᱟᱨ ᱴᱷᱤᱠᱚᱬᱟᱹ ᱠᱚ

source: Cross-site and social media trackers
sat: ᱠᱨᱚᱥᱼᱥᱟᱭᱤᱴ ᱟᱨ ᱥᱳᱥᱤᱭᱟᱞ ᱢᱤᱰᱤᱭᱟ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ

source: Cross-Site Tracking Cookies
sat: ᱠᱨᱚᱥᱼᱥᱟᱭᱤᱴ ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱠᱩᱠᱤ ᱠᱚ

source: Cryptominers
sat: ᱠᱨᱭᱯᱴᱚᱢᱟᱭᱱᱟᱹᱨ ᱠᱚ

source: Custom
sat: ᱠᱩᱥᱤᱭᱟᱜ

source: Custom Add-on collection
sat: ᱠᱟᱹᱥᱴᱚᱢ ᱮᱰᱰᱼᱚᱱ ᱛᱩᱢᱟᱹᱞ

source: Custom Firefox Account server
sat: ᱠᱟᱹᱥᱴᱚᱢ Firefox ᱠᱷᱟᱛᱟ ᱥᱟᱹᱨᱣᱟᱹᱨ

source: Customize
sat: ᱠᱩᱥᱤᱭᱟᱜ ᱛᱮᱭᱟᱨ

source: Custom search engine details
sat: ᱠᱩᱥᱤᱭᱟᱜ ᱥᱮᱸᱫᱽᱨᱟ ᱤᱧᱡᱤᱱ ᱨᱮᱭᱟᱜ ᱵᱤᱵᱨᱚᱬ

source: Custom Sync server
sat: ᱠᱩᱥᱤᱭᱟᱜ ᱥᱤᱸᱠ ᱥᱟᱹᱨᱣᱟᱹᱨ

source: %d addresses
sat: %d ᱴᱷᱤᱠᱬᱟᱹ ᱠᱚ

source: Dark
sat: ᱧᱩᱛ

source: Dark color scheme
sat: ᱧᱩᱛ ᱨᱚᱝ ᱯᱚᱱᱛᱷᱟ

source: Dark theme
sat: ᱧᱩᱛ ᱩᱭᱦᱟᱹᱨ

source: Data choices
sat: ᱥᱟᱹᱠᱷᱤᱭᱟᱹᱛ ᱠᱩᱥᱤᱭᱟᱜ ᱠᱚ

source: Data collection
sat: ᱟᱸᱠᱲᱟ ᱛᱩᱢᱟᱹᱞ

source: Debug menu: %1$d click(s) left to enable
sat: ᱫᱚᱥ ᱥᱟᱦᱟ ᱢᱮᱱᱭᱩ:%1$d ᱮᱦᱚᱵᱽ ᱞᱟᱹᱜᱤᱫ ᱞᱮᱸᱜᱟ ᱥᱮᱫ ᱚᱛᱟᱭ ᱢᱮ

source: Debug menu enabled
sat: ᱫᱚᱥ ᱥᱟᱦᱟ ᱢᱮᱱᱭᱩ ᱮᱢᱮᱱᱟ

source: Dec
sat: ᱟᱜᱷ

source: Deceptive site issue
sat: ᱮᱲᱮ ᱥᱟᱭᱤᱴ ᱵᱟᱵᱚᱛ

source: Default search engine
sat: ᱢᱩᱞ ᱥᱮᱸᱫᱽᱨᱟ ᱤᱱᱡᱤᱱ

source: Delete
sat: ᱢᱮᱴᱟᱣ ᱢᱮ

source: Delete %1$d items
sat: %1$d ᱡᱤᱱᱤᱥ ᱠᱚ ᱢᱮᱴᱟᱣ

source: Delete %1$s?
sat: %1$s ᱢᱮᱴᱟᱣᱟ ᱥᱮ?

source: Delete all exceptions
sat: ᱡᱚᱛᱚ ᱪᱷᱟᱰᱟ ᱠᱚ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Delete and Open
sat: ᱢᱮᱴᱟᱣ ᱢᱮ ᱟᱨ ᱡᱷᱤᱡ ᱢᱮ

source: Delete browsing data
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱴᱟ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Delete browsing data on quit
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱴᱟ ᱢᱮᱴᱟᱣ ᱢᱮ ᱟᱲᱟᱜ ᱜᱷᱚᱲᱤ

source: Delete collection
sat: ᱛᱩᱢᱟᱹᱞ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Deleted %1$s
sat: %1$s ᱢᱮᱴᱟᱣᱮᱱᱟ

source: Delete downloads
sat: ᱰᱟᱩᱱᱞᱳᱰ ᱠᱚ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Deleted %s
sat: %s ᱢᱮᱴᱟᱣᱮᱱᱟ

source: Delete from history
sat: ᱦᱤᱛᱟᱹᱞ ᱠᱷᱚᱱ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Delete history
sat: ᱦᱤᱛᱟᱹᱞ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Delete private tabs
sat: ᱯᱨᱭᱣᱮᱴ ᱴᱮᱵ ᱠᱚ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Delete session
sat: ᱚᱠᱛᱚ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Deleting browsing data…
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱴᱟ ᱢᱮᱴᱟᱣ ᱦᱩᱭᱩ ᱠᱟᱱᱟ…

source: Deleting selected folders
sat: ᱵᱟᱪᱷᱟᱣᱠᱟᱱ ᱯᱚᱴᱚᱢ ᱠᱚ ᱢᱮᱴᱟᱣ ᱦᱩᱭᱩ ᱠᱟᱱᱟ

source: Deleting this tab will delete the entire collection. You can create new collections at any time.
sat: ᱱᱚᱶᱟ ᱴᱮᱵ ᱢᱮᱴᱟᱣ ᱞᱮᱠᱷᱟᱭ ᱥᱟᱱᱟᱢ ᱛᱩᱢᱟᱹᱞ ᱢᱮᱴᱟᱣ ᱪᱟᱵᱟᱜ-ᱟ ᱾ ᱚᱠᱟ ᱥᱚᱢᱚᱭ ᱨᱮ ᱦᱚᱸ ᱟᱢ ᱱᱟᱶᱟ ᱛᱩᱢᱟᱹᱞ ᱠᱚ ᱛᱮᱭᱟᱨ ᱫᱟᱲᱮᱼᱟᱜ ᱟᱢ ᱾

source: Deny
sat: ᱢᱟᱱᱟ

source: DENY
sat: ᱵᱟᱹᱰ

source: Deselect all
sat: ᱡᱚᱛᱚ ᱠᱚ ᱵᱟᱝ ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Desktop Bookmarks
sat: ᱰᱮᱥᱠᱴᱚᱯ ᱵᱩᱠᱢᱟᱨᱠ ᱠᱚ

source: Desktop site
sat: ᱰᱮᱥᱠᱴᱟᱹᱯ ᱥᱟᱭᱤᱴ

source: Details
sat: ᱵᱤᱵᱨᱚᱬ

source: Developer tools
sat: ᱵᱟᱲᱦᱟᱣᱟᱜ ᱦᱟᱹᱛᱤᱭᱟᱹᱨ

source: Device name
sat: ᱥᱟᱫᱷᱚᱱ ᱧᱩᱛᱩᱢ

source: Device name cannot be empty.
sat: ᱥᱟᱫᱷᱚᱱ ᱧᱩᱛᱩᱢ ᱠᱷᱟᱹᱞᱤ ᱵᱟᱝ ᱦᱩᱭ ᱫᱟᱰᱮᱜ-ᱟ ᱾

source: Disabled
sat: ᱵᱚᱸᱫᱚᱭ

source: Disable private browsing
sat: ᱱᱤᱡᱮᱨᱟᱜ ᱵᱽᱨᱳᱣᱡᱤᱝ ᱵᱟᱝ ᱦᱩᱭ ᱦᱚᱪᱚᱜ ᱢᱮ

source: Discard changes
sat: ᱵᱚᱫᱚᱞ ᱩᱰᱩᱜ ᱜᱤᱰᱤ ᱢᱮ

source: Disconnect
sat: ᱡᱚᱱᱚᱲᱟᱣ ᱚᱪᱚᱜ

source: Dismiss
sat: ᱵᱟᱹᱰ

source: Dismiss find in page
sat: ᱥᱟᱦᱴᱟ ᱨᱮ ᱧᱟᱢ ᱚᱰᱚᱠ ᱵᱟᱫ ᱢᱮ

source: Display notifications to you
sat: ᱤᱛᱞᱟᱹᱭ ᱠᱚ ᱩᱫᱩᱜ ᱟᱢᱟᱭ

source: Don’t allow
sat: ᱟᱞᱚ ᱢᱟᱸᱡᱩᱨᱮᱭᱟᱢ

source: Don’t save
sat: ᱟᱞᱚᱢ ᱥᱟᱸᱪᱟᱣ-ᱟ

source: Don’t update
sat: ᱟᱞᱚᱢ ᱦᱟᱹᱞᱤᱭᱟᱜ-ᱟ

source: Download
sat: ᱰᱟᱩᱱᱞᱳᱰ

source: Download (%1$s)
sat: ᱰᱟᱩᱱᱞᱳᱰ (%1$s)

source: Download completed
sat: ᱰᱟᱩᱱᱞᱳᱰ ᱯᱩᱨᱟᱹᱣᱮᱱᱟ

source: Download failed
sat: ᱰᱟᱩᱱᱞᱳᱰ ᱰᱤᱜᱟᱹᱣᱮᱱᱟ

source: Download files and read and modify the browser’s download history
sat: ᱨᱮᱫ ᱰᱟᱩᱱᱞᱳᱰ ᱢᱮ ᱟᱨ ᱯᱟᱲᱦᱟᱣ ᱢᱮ ᱟᱨ ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱩᱱᱞᱳᱰ ᱦᱤᱛᱟᱹᱞ ᱵᱚᱫᱚᱞ ᱢᱮ

source: Downloading and verifying add-on…
sat: ᱮᱰ-ᱚᱱ ᱰᱟᱩᱱᱞᱳᱰ ᱟᱨ ᱧᱮᱞ ᱢᱮᱲᱟᱣ ᱦᱩᱭᱩᱜ ᱠᱟᱱᱟ ...

source: Download link
sat: ᱰᱟᱩᱱᱞᱳᱰ ᱞᱤᱸᱠ

source: Download paused
sat: ᱰᱟᱩᱱᱞᱳᱰ ᱛᱷᱩᱠᱩᱢ ᱟᱠᱟᱱᱟ

source: Downloads
sat: ᱰᱟᱩᱱᱞᱳᱰ ᱠᱚ

source: Downloads Deleted
sat: ᱰᱟᱩᱱᱞᱳᱰ ᱠᱚ ᱢᱮᱴᱟᱣ ᱮᱱᱟ

source: Downloads Removed
sat: ᱰᱟᱩᱱᱞᱳᱰᱠᱚ ᱚᱪᱚᱜᱮᱱᱟ

source: Do you want %s to save this login?
sat: ᱟᱢ ᱪᱮᱫ %s ᱱᱚᱶᱟ ᱞᱚᱜᱤᱱ ᱥᱟᱸᱪᱟᱣ ᱥᱮᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Do you want to leave this site? Data you have entered may not be saved
sat: ᱪᱮᱫ ᱟᱢ ᱱᱚᱶᱟ ᱥᱟᱭᱤᱴ ᱵᱟᱹᱜᱤ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ? ᱰᱟᱴᱟ ᱡᱟᱦᱸᱟ ᱟᱢ ᱟᱫᱮᱨ ᱞᱮᱫᱟᱢ ᱚᱱᱟ ᱥᱟᱸᱪᱟᱣ ᱵᱟᱝ ᱦᱩᱭᱩᱜ-ᱟ

source: %d pages
sat: %d ᱥᱟᱦᱴᱟ ᱠᱚ

source: DRM-controlled content
sat: DRM-ᱠᱚᱵᱽᱡᱟ ᱡᱤᱱᱤᱥ

source: %d tab
sat: %d ᱴᱮᱵ

source: %d tabs
sat: %d ᱴᱮᱵ ᱠᱚ

source: %d tab selected
sat: %d ᱴᱮᱵ ᱵᱟᱪᱷᱟᱣ ᱟᱠᱟᱱᱟ

source: %d tabs selected
sat: %d ᱴᱮᱵ ᱠᱚ ᱵᱟᱪᱷᱟᱣ ᱟᱠᱟᱱᱟ

source: Edit
sat: ᱥᱟᱯᱲᱟᱣ

source: EDIT
sat: ᱥᱟᱯᱲᱣ ᱢᱮ

source: Edit bookmark
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱥᱟᱯᱲᱣ ᱢᱮ

source: Edit folder
sat: ᱯᱚᱴᱚᱢ ᱥᱮᱞᱮᱫᱽ ᱢᱮ

source: Edit search engine
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱤᱧᱡᱤᱱ ᱥᱟᱯᱲᱟᱣ ᱢᱮ

source: Email
sat: ᱤᱼᱢᱮᱞ

source: Email address copied to clipboard
sat: ᱤᱼᱢᱮᱞ ᱴᱷᱤᱠᱬᱟᱹ ᱨᱮᱴᱚᱵᱼᱵᱚᱰ ᱨᱮ ᱱᱚᱠᱚᱞᱮᱱᱟ

source: Email with…
sat: ᱱᱚᱶᱟ ᱛᱮ ᱤᱢᱮᱞ ᱢᱮ ...

source: Enabled
sat: ᱮᱢ ᱪᱷᱚ

source: Enable private browsing
sat: ᱱᱤᱡᱮᱨᱟᱜ ᱵᱽᱨᱳᱣᱡᱤᱝ ᱦᱩᱭ ᱦᱚᱪᱚᱭ ᱢᱮ

source: Enable to allow pinch and zoom, even on websites that prevent this gesture.
sat: ᱯᱤᱸᱪ ᱟᱨ ᱡᱩᱻᱢ ᱮᱢ ᱪᱷᱚᱭ ᱢᱮ, ᱣᱮᱵᱥᱟᱭᱤᱴ ᱠᱚ ᱜᱮᱥᱪᱚᱨ ᱢᱟᱱᱟ ᱨᱮᱦᱚᱸ ᱱᱚᱶᱟ ᱮᱢ ᱪᱷᱚᱭ ᱢᱮ᱾

source: Enhanced Tracking Protection
sat: ᱵᱟᱲᱦᱟᱣᱟᱠᱟᱱ ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ

source: Enhanced Tracking Protection is off for these websites
sat: ᱱᱚᱶᱟ ᱠᱚ ᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱛ ᱵᱟᱲᱦᱟᱣᱟᱠᱟᱱ ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ ᱵᱚᱸᱫᱚ ᱢᱮᱱᱟᱜ-ᱟ

source: Enter a search string
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱥᱴᱨᱭᱸᱜ ᱟᱫᱮᱨ ᱢᱮ

source: Entered multiselect mode, select tabs to save to a collection
sat: ᱢᱟᱹᱞᱴᱤᱥᱤᱞᱮᱠᱼᱴ ᱢᱳᱰ ᱵᱚᱞᱚ ᱮᱱᱟᱢ, ᱛᱩᱢᱟᱹᱞ ᱥᱟᱸᱪᱟᱣ ᱞᱟᱹᱜᱤᱫ ᱨᱮᱵ ᱠᱚ ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Entering full screen mode
sat: ᱯᱩᱨᱟᱹ ᱠᱨᱤᱱ ᱢᱳᱰ ᱵᱚᱞᱚᱱ ᱠᱟᱱᱟᱢ

source: Enter search engine name
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱤᱧᱡᱤᱱ ᱨᱮᱭᱟᱜ ᱧᱩᱛᱩᱢ ᱟᱫᱮᱨ ᱢᱮ

source: Error
sat: ᱵᱷᱩᱞ

source: Error connecting to “%s”
sat: %s ᱨᱮ ᱡᱩᱲᱟᱹᱣ ᱛᱮ ᱵᱷᱩᱞ ᱦᱩᱭᱮᱱᱟ

source: Every time the shield is purple, %s has blocked trackers on a site. Tap for more info.
sat: ᱡᱟᱷᱟᱸ ᱥᱚᱢᱚᱭ ᱨᱮᱜᱮ ᱥᱤᱸᱞᱰ ᱵᱮᱸᱜᱚᱱᱤ ᱛᱟᱦᱮᱸᱱᱟ, %s ᱫᱚ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ ᱥᱟᱭᱤᱴ ᱠᱚᱨᱮ ᱵᱞᱚᱠ ᱠᱚᱣᱟᱭ ᱾ ᱡᱟᱹᱥᱛᱤ ᱵᱟᱲᱟᱭ ᱞᱟᱹᱜᱤᱫ ᱴᱤᱯᱟᱹᱣ ᱯᱮ ᱾

source: Exceptions
sat: ᱪᱷᱟᱰᱟ ᱠᱚ

source: Exceptions let you disable tracking protection for selected sites.
sat: ᱵᱟᱪᱷᱟᱣᱟᱠᱟᱱ ᱫᱟᱭᱤᱴ ᱠᱚᱨᱮ ᱟᱢ ᱤᱪᱷᱟᱹ ᱚᱱᱩᱥᱟᱨ ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱵᱚᱸᱫᱚ ᱫᱟᱲᱮᱭᱟᱜᱼᱟᱢ ᱾

source: Exchange messages with apps other that this one
sat: ᱱᱟᱶᱟ ᱮᱯᱯ ᱪᱷᱟᱰᱤ ᱠᱟᱛᱮ ᱚᱠᱜᱟ ᱮᱯᱯ ᱠᱚᱛᱮ ᱠᱷᱚᱵᱚᱨ ᱵᱚᱫᱚᱞ ᱢᱮ

source: Exited multiselect mode
sat: ᱵᱟᱹᱰ ᱟᱠᱟᱱᱟ ᱢᱟᱹᱴᱤᱥᱤᱞᱮᱼᱴ ᱢᱳᱰ

source: Exit multiselect mode
sat: ᱢᱟᱹᱞᱴᱤᱥᱤᱞᱮᱠᱼᱴ ᱢᱳᱰ ᱵᱟᱹᱰ

source: Expand suggested logins
sat: ᱵᱟᱛᱟᱣᱟᱠᱟᱱ ᱞᱚᱜᱤᱱ ᱠᱚ ᱴᱟᱨᱟᱝ ᱪᱷᱚᱭ ᱢᱮ

source: Experiments
sat: ᱵᱤᱰᱟᱣ

source: Extend developer tools to access your data in open tabs
sat: ᱟᱢᱟᱜ ᱰᱟᱴᱟ ᱠᱷᱩᱞᱟᱹ ᱴᱮᱵ ᱠᱚᱨᱮ ᱟᱹᱛᱩᱨ ᱞᱟᱹᱜᱤᱫ ᱛᱮ ᱵᱟᱲᱦᱟᱣᱟᱜ ᱴᱩᱞ ᱚᱥᱟᱨ ᱢᱮ

source: External download manager
sat: ᱵᱟᱦᱨᱮ ᱨᱮᱭᱟᱜ ᱰᱟᱣᱱᱞᱳᱰ ᱢᱮᱱᱮᱡᱟᱹᱨ

source: Failed to disable %1$s
sat: %1$s ᱵᱚᱸᱫᱚᱭ ᱨᱮ ᱰᱤᱜᱟᱹᱣ

source: Failed to enable %1$s
sat: %1$s ᱮᱢ ᱨᱮ ᱦᱩᱰᱟᱹᱜ

source: Failed to install %1$s
sat: %1$s ᱵᱚᱦᱟᱞ ᱰᱤᱜᱟᱹᱣᱮᱱᱟ

source: Failed to query Add-ons!
sat: ᱮᱰ-ᱚᱱ ᱠᱚ ᱠᱩᱠᱞᱟᱹᱭ ᱰᱤᱜᱟᱹᱣᱮᱱᱟ!

source: Failed to remove %1$s
sat: %1$s ᱚᱪᱚᱜ ᱰᱤᱜᱟᱹᱣᱮᱱᱟ

source: Failed to sign-in
sat: ᱵᱚᱞᱚᱱ ᱥᱩᱦᱤ ᱰᱤᱜᱟᱹᱣᱮᱱᱟ

source: Failed to uninstall %1$s
sat: %1$s ᱵᱚᱦᱟᱞ ᱚᱪᱚᱜ ᱰᱤᱜᱟᱹᱣᱮᱱᱟ

source: Feb
sat: ᱢᱟᱜ

source: File Not Found
sat: ᱨᱮᱫ ᱵᱟᱝ ᱧᱟᱢ ᱞᱮᱱᱟ

source: Fill link from clipboard
sat: ᱠᱞᱤᱯᱷᱵᱚᱰ ᱠᱷᱚᱱ ᱞᱤᱸᱠ ᱯᱮᱨᱮᱡ ᱢᱮ

source: Find in page
sat: ᱥᱟᱦᱴᱟ ᱨᱮ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: Find next result
sat: ᱤᱱᱟᱹ ᱛᱟᱭᱚᱢᱟᱜ ᱠᱩᱲᱟᱹᱭ ᱧᱟᱢ ᱢᱮ

source: Find previous result
sat: ᱞᱟᱦᱟ ᱛᱮᱭᱟᱜ ᱠᱩᱲᱟᱹᱭ ᱧᱟᱢ ᱢᱮ

source: Fingerprinters
sat: ᱠᱟᱹᱴᱩᱵᱪᱷᱟᱯᱟ ᱟᱜ ᱠᱚ

source: Firefox Account
sat: Firefox ᱠᱷᱟᱛᱟ

source: Firefox Account/Sync server modified. Quitting the application to apply changes…
sat: Firefox ᱠᱷᱟᱛᱟ/ ᱥᱭᱸᱠ ᱠᱟᱹᱨᱣᱟᱹᱨ ᱵᱚᱫᱚᱞᱮᱱᱟ ᱾ ᱵᱚᱫᱚᱞ ᱠᱚ ᱫᱚᱦᱚ ᱞᱟᱹᱜᱤᱫ ᱮᱯᱯᱞᱤᱠᱮᱥᱚᱱ ᱵᱚᱸᱫᱚᱜ ᱠᱟᱱᱟ…

source: Firefox add-on technology is modernizing. These add-ons use frameworks that are not compatible with Firefox 75 & beyond.
sat: Firefox ᱮᱰᱼᱚᱱ ᱴᱮᱠᱱᱚᱞᱚᱡᱭ ᱫᱚ ᱢᱚᱰᱮᱱᱚᱜ ᱠᱟᱱᱟ ᱾ ᱱᱚᱣᱟ ᱮᱰᱼᱚᱱ ᱯᱷᱨᱮᱢᱣᱟᱨᱠ ᱠᱚ ᱵᱮᱵᱷᱟᱨᱟᱭ ᱚᱠᱟ ᱫᱚ Firefox 75 ᱟᱨ ᱚᱱᱟ ᱞᱟᱛᱟᱨ ᱵᱷᱟᱹᱥᱚᱱ ᱥᱟᱞᱟᱜ ᱵᱟᱭ ᱠᱟᱹᱢᱤ ᱟᱭ ᱾
